In [87]:
db={0:["name","roll no.","subject 1","subject 2","subject 3"]}

In [ ]:
l=['a','b']

In [ ]:
l['a']

In [60]:
db

{0: ['name', 'roll no.', 'subject 1', 'subject 2', 'subject 3']}

In [64]:
db[2]=["Alice",101,85,90,92]

In [65]:
db

{0: ['name', 'roll no.', 'subject 1', 'subject 2', 'subject 3'],
 1: ['Alice', 101, 85, 90, 92],
 2: ['Alice', 101, 85, 90, 92]}

In [82]:
sum(db[1][2:])/3

89.0

In [86]:
import pandas as pd
pd.DataFrame(db)

           0      1      2
0       name  Alice  Alice
1   roll no.    101    101
2  subject 1     85     85
3  subject 2     90     90
4  subject 3     92     92

In [83]:
len(db)

3

In [80]:
for r,s in db:
    print(r,s)

TypeError: cannot unpack non-iterable int object

In [88]:
g=None
g=1
g

1